# DATASET: Titanic

In [1]:
%pwd  # magic command

'C:\\Users\\sc522\\PROJECTS\\STAT\\IS5\\code\\ch03'

In [2]:
import pandas as pd
print(pd.__version__)

1.5.3

In [3]:
file_name = "../../dataset/ch02/titanic.txt"
titanic = pd.read_csv(file_name, sep='\t')

In [4]:
titanic.head()  # a few rows on the top, including header

,Name,Survived,Boarded,Class,MWC,Age,Adut_or_Chld,Sex,Paid,Ticket_No,Boat_or_Body,Job,Class_Dept,Class_Full
0,"ABBING, Mr Anthony",Dead,Southampton,3,Man,42.0,Adult,Male,7.55,5547,NaN,Blacksmith,3rd Class Passenger,3
1,"ABBOTT, Mr Ernest Owen",Dead,Southampton,Crew,Man,21.0,Adult,Male,NaN,NaN,NaN,Lounge Pantry Steward,Victualling Crew,V
2,"ABBOTT, Mr Eugene Joseph",Dead,Southampton,3,Child,14.0,Child,Male,20.25,CA2673,NaN,Scholar,3rd Class Passenger,3
3,"ABBOTT, Mr Rossmore Edward",Dead,Southampton,3,Man,16.0,Adult,Male,20.25,CA2673,[190],Jeweller,3rd Class Passenger,3
4,"ABBOTT, Mrs Rhoda Mary 'Rosa'",Alive,Southampton,3,Woman,39.0,Adult,Female,20.25,CA2673,A,NaN,3rd Class Passenger,3

In [5]:
pd.crosstab(index=titanic.Class, columns=titanic.Survived)

Survived  Alive  Dead
Class
1           201   123
2           119   166
3           180   530
Crew        212   677

In [8]:
pd.crosstab(index=titanic.Class, columns=titanic.Survived, 
            normalize='columns', margins=True).mul(100).round(1).astype(str) + '%'

Survived  Alive   Dead    All
Class
1         28.2%   8.2%  14.7%
2         16.7%  11.1%  12.9%
3         25.3%  35.4%  32.2%
Crew      29.8%  45.3%  40.3%

In [9]:
pd.crosstab(index=titanic.Class, columns=titanic.Survived, 
            normalize='index', margins=True).mul(100).round(1).astype(str) + '%'

Survived  Alive   Dead
Class
1         62.0%  38.0%
2         41.8%  58.2%
3         25.4%  74.6%
Crew      23.8%  76.2%
All       32.2%  67.8%